name: "DirectDehazing"

input: "img_1"
input_dim: 1
input_dim: 3
input_dim: 720
input_dim: 1280

input: "img_2"
input_dim: 1
input_dim: 3
input_dim: 720
input_dim: 1280

input: "img"
input_dim: 1
input_dim: 3
input_dim: 720
input_dim: 1280

input: "img_3"
input_dim: 1
input_dim: 3
input_dim: 720
input_dim: 1280

input: "img_4"
input_dim: 1
input_dim: 3
input_dim: 720
input_dim: 1280

input: "label"
input_dim: 1
input_dim: 3
input_dim: 720
input_dim: 1280
####################################1
layer {
  name: "conv1_1"
  type: "Convolution"
  bottom: "img_1"
  top: "conv1_1"
  convolution_param {
    num_output: 3
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
   name: "relu1_1"
   type: "ReLU"
   bottom: "conv1_1"
   top: "conv1_1"
 }

 layer {
  name: "conv2_1"
  type: "Convolution"
  bottom: "conv1_1"
  top: "conv2_1"
  convolution_param {
    num_output: 3
    kernel_size: 3
    pad:1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
   name: "relu2_1"
   type: "ReLU"
   bottom: "conv2_1"
   top: "conv2_1"
 }




 ########################################################2
 layer {
  name: "conv1_2"
  type: "Convolution"
  bottom: "img_2"
  top: "conv1_2"
  convolution_param {
    num_output: 3
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
   name: "relu1_2"
   type: "ReLU"
   bottom: "conv1_2"
   top: "conv1_2"
 }

 layer {
  name: "conv2_2"
  type: "Convolution"
  bottom: "conv1_2"
  top: "conv2_2"
  convolution_param {
    num_output: 3
    kernel_size: 3
    pad:1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
   name: "relu2_2"
   type: "ReLU"
   bottom: "conv2_2"
   top: "conv2_2"
 }




 #########################################################3
 layer {
  name: "conv1_3"
  type: "Convolution"
  bottom: "img"
  top: "conv1_3"
  convolution_param {
    num_output: 3
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
   name: "relu1_3"
   type: "ReLU"
   bottom: "conv1_3"
   top: "conv1_3"
 }

 layer {
  name: "conv2_3"
  type: "Convolution"
  bottom: "conv1_3"
  top: "conv2_3"
  convolution_param {
    num_output: 3
    kernel_size: 3
    pad:1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
   name: "relu2_3"
   type: "ReLU"
   bottom: "conv2_3"
   top: "conv2_3"
 }




 ###############################################4
 layer {
  name: "conv1_4"
  type: "Convolution"
  bottom: "img_3"
  top: "conv1_4"
  convolution_param {
    num_output: 3
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
   name: "relu1_4"
   type: "ReLU"
   bottom: "conv1_4"
   top: "conv1_4"
 }

 layer {
  name: "conv2_4"
  type: "Convolution"
  bottom: "conv1_4"
  top: "conv2_4"
  convolution_param {
    num_output: 3
    kernel_size: 3
    pad:1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
   name: "relu2_4"
   type: "ReLU"
   bottom: "conv2_4"
   top: "conv2_4"
 }




 ###############################################5
 layer {
  name: "conv1_5"
  type: "Convolution"
  bottom: "img_4"
  top: "conv1_5"
  convolution_param {
    num_output: 3
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
   name: "relu1_5"
   type: "ReLU"
   bottom: "conv1_5"
   top: "conv1_5"
 }

 layer {
  name: "conv2_5"
  type: "Convolution"
  bottom: "conv1_5"
  top: "conv2_5"
  convolution_param {
    num_output: 3
    kernel_size: 3
    pad:1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
   name: "relu2_5"
   type: "ReLU"
   bottom: "conv2_5"
   top: "conv2_5"
 }



 ############################concat_
layer {
  name: "Concat_"
  type: "Concat"
  bottom: "conv2_1"
  bottom: "conv2_2"
  bottom: "conv2_3"
  bottom: "conv2_4"
  bottom: "conv2_5"
  top: "Concat_"
  concat_param {
    axis: 1
  }
}

layer {
  name: "conv"
  type: "Convolution"
  bottom: "Concat_"
  top: "conv2"
  convolution_param {
    num_output: 3
    kernel_size: 3
    pad:1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "Concat1"
  type: "Concat"
  bottom: "conv1_3"
  bottom: "conv2"
  top: "Concat1"
  concat_param {
    axis: 1
  }
}

 layer {
  name: "conv3"
  type: "Convolution"
  bottom: "Concat1"
  top: "conv3"
  convolution_param {
    num_output: 3
    kernel_size: 5
    pad:2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
   name: "relu3"
   type: "ReLU"
   bottom: "conv3"
   top: "conv3"
 }





layer {
  name: "Concat2"
  type: "Concat"
  bottom: "conv2"
  bottom: "conv3"
  top: "Concat2"
  concat_param {
    axis: 1
  }
}
 layer {
  name: "conv4"
  type: "Convolution"
  bottom: "Concat2"
  top: "conv4"
  convolution_param {
    num_output: 3
    kernel_size: 7
    pad:3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
   name: "relu4"
   type: "ReLU"
   bottom: "conv4"
   top: "conv4"
 }

 layer {
  name: "Concat3"
  type: "Concat"
  bottom: "conv1_3"
  bottom: "conv2"
  bottom: "conv3"
  bottom: "conv4"
  top: "Concat3"
  concat_param {
    axis: 1
  }
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "Concat3"
  top: "conv5"
  param {
    lr_mult: 0.1
  }
  param {
    lr_mult: 1
  }
  convolution_param {
    num_output: 3
    kernel_size: 3
    pad:1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
   name: "relu5"
   type: "ReLU"
   bottom: "conv5"
   top: "K"
 }

layer {
  name: "prod"
  type: "Eltwise"
  bottom: "img"
  bottom: "K"
  top: "prod"
  eltwise_param {
    operation: PROD
  }
}
layer {
 name:"eltwise_layer"
 type:"Eltwise"
 bottom:"prod"
 bottom:"K"
 top:"eltwise_layer"
 eltwise_param{
   operation:SUM
   coeff:1
   coeff:-1
 }
}
layer {
  name: "sum"
  bottom: "eltwise_layer"
  top: "sum"
  type: "Power"
  power_param {
    power: 1
    scale: 1
    shift: 1
  }
}


layer {
   name: "clip_1"
   type: "ReLU"
   bottom: "sum"
   top: "sum"
 }


